{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/zhou/Desktop/ml.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}26 May 2021, 03:27:35

{com}. lobal learner "svm"
{err}command {bf}lobal{sf} is unrecognized
{txt}{search r(199), local:r(199);}

{com}. global y daily_0

. global x "negative-positive"

. gen i=_n

. preserve

. keep if i<145
{txt}(7 observations deleted)

{com}. drop i

. save data_train, replace
{txt}(note: file data_train.dta not found)
file data_train.dta saved

{com}. restore

. preserve

. keep if i>144
{txt}(144 observations deleted)

{com}. drop $y

. drop i

. save data_test, replace
{txt}(note: file data_test.dta not found)
file data_test.dta saved

{com}. restore

. preserve

. keep if i>144
{txt}(144 observations deleted)

{com}. keep $y

. gen index=_n-1

. save test_y, replace
{txt}(note: file test_y.dta not found)
file test_y.dta saved

{com}. restore

. use data_train, clear

. r_ml_stata $y $x, mlmodel($learner) in_prediction("in_pred")  cross_validation("CV") out_sample("data_test") out_prediction("out_pred") seed(10) save_graph_cv("graph_cv")
{txt}(note: file /var/folders/cg/c7mvpbk97nd5rh8rkw5zwn_w0000gn/T//S_11614.00000j not found)
file /var/folders/cg/c7mvpbk97nd5rh8rkw5zwn_w0000gn/T//S_11614.00000j saved
(0 observations deleted)
(note: file /var/folders/cg/c7mvpbk97nd5rh8rkw5zwn_w0000gn/T//S_11614.00000l not found)
file /var/folders/cg/c7mvpbk97nd5rh8rkw5zwn_w0000gn/T//S_11614.00000l saved
{res}      daily_0  negative   neutral   positive
0    0.111966  1.446809  3.921569  20.782504
1    0.131907  1.254902  3.264151  19.506217
2    0.167792  1.180000  3.428571  18.134104
3    0.057064  0.916667  2.113208  17.492903
4    0.003655  0.886792  1.559322  18.986158
..        ...       ...       ...        ...
139  0.115015  1.492537  1.833333  32.850000
140  0.258763  1.634921  2.784314  35.883333
141  0.342304  2.000000  3.594595  30.928529
142  0.339723  2.549020  2.800000  30.006667
143  0.468150  2.259259  4.552632  47.206140

[144 rows x 4 columns]
<class 'pandas.core.frame.DataFrame'>
Int64Index: 144 entries, 0 to 143
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype  
---  ------    --------------  -----  
 0   daily_0   144 non-null    float64
 1   negative  144 non-null    float64
 2   neutral   144 non-null    float64
 3   positive  144 non-null    float64
dtypes: float64(4)
memory usage: 5.6 KB
                                                      
                                                      
------------------------------------------------------
CROSS-VALIDATION RESULTS TABLE
------------------------------------------------------
The best score is:
0.11427338134484644
------------------------------------------------------
The best parameters are:
{c -(}'C': 1, 'gamma': 0.1{c )-}
1
0.1
------------------------------------------------------
The best estimator is:
SVR(C=1, gamma=0.1)
------------------------------------------------------
The best index is:
0
------------------------------------------------------
[0.53783634 0.23992003 0.20487599 0.32771309 0.31226559 0.31566993
 0.25110787]
{err}/Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages/pandas/io/stata.py:2346: InvalidColumnName: 
Not all pandas column names were valid Stata variable names.
The following replacements have been made:

    0   ->   _0

If this is not what you expect, please make sure you have Stata-compliant
column names in your DataFrame (strings only, max 32 characters, only
alphanumerics and underscores, no Stata reserved words)

  warnings.warn(ws, InvalidColumnName)
{txt}(note: file in_pred.dta not found)
file in_pred.dta saved
{res}{txt}file out_pred.dta saved
{res}{txt}(note: file graph_cv.gph not found)
{res}{txt}(file graph_cv.gph saved)

{com}. 
. ereturn list

{txt}scalars:
              e(OPT_C) =  {res}1
          {txt}e(OPT_GAMMA) =  {res}.1
      {txt}e(TEST_ACCURACY) =  {res}.1142733813448464
     {txt}e(TRAIN_ACCURACY) =  {res}.9146972105661539
         {txt}e(BEST_INDEX) =  {res}0
   {txt}e(SE_TEST_ACCURACY) =  {res}.7191751309556559

{com}. use in_pred, clear

. gen id=_n

. sort id

. tw(line $y id, lc(green)) (line in_pred id, lc(orange)), xtitle("Units' Identifier") legend(order(1 "Actual" 2 "In-sample prediction")) note(LEARNER: $learner) plotregion(style(none)) scheme(s1mono)
{res}
{com}. graph save "Graph" "/Users/zhou/Desktop/in.gph"
{res}{txt}(file /Users/zhou/Desktop/in.gph saved)

{com}. use out_pred, clear

. merge 1:1 index using "test_y"
{res}{txt}{p 0 7 2}
(note: variable
index was 
long, now double to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}               7{txt}  (_merge==3)
{col 5}{hline 41}

{com}. tw(line $y index, lc(green)) (line out_sample_pred index, lc(orange)), xtitle("Units' Identifier") legend(order(1 "Actual" 2 "Out-sample prediction")) note(LEARNER: $learner) plotregion(style(none)) scheme(s1mono)
{res}
{com}. use CV, clear

. list in 1/10, table
{txt}
     {c TLC}{hline 7}{c -}{hline 11}{c -}{hline 12}{c -}{hline 11}{c TRC}
     {c |} {res}index   mean_tr~e   mean_tes~e   std_tes~e {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 12}{c -}{hline 11}{c RT}
  1. {c |} {res}    0   .91469721    .11427338   .71917513 {txt}{c |}
  2. {c |} {res}    1   .91470169    .04049797   .84707451 {txt}{c |}
  3. {c |} {res}    2   .91492346   -.01541773   .91086357 {txt}{c |}
  4. {c |} {res}    3   .91275722   -.04771787   .95206437 {txt}{c |}
  5. {c |} {res}    4   .91007225   -.06640476   .95737092 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c -}{hline 12}{c -}{hline 11}{c RT}
  6. {c |} {res}    5    .9084877   -.08492036   .95109815 {txt}{c |}
  7. {c |} {res}    6   .90732225   -.09837269   .93760048 {txt}{c |}
  8. {c |} {res}    7   .90663303   -.11098453   .92223786 {txt}{c |}
  9. {c |} {res}    8   .90649839   -.12188812    .9014257 {txt}{c |}
 10. {c |} {res}    9    .9064158   -.13040603   .87988951 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 11}{c -}{hline 12}{c -}{hline 11}{c BRC}

{com}. use out_pred , clear

. list in 1/10, table
{err}observation numbers out of range
{txt}{search r(198), local:r(198);}

{com}. 
. graph save "Graph" "/Users/zhou/Desktop/out.gph"
{res}{txt}(file /Users/zhou/Desktop/out.gph saved)

{com}. list
{txt}
     {c TLC}{hline 7}{c -}{hline 11}{c TRC}
     {c |} {res}index   out_sam~d {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c RT}
  1. {c |} {res}    0   .53783634 {txt}{c |}
  2. {c |} {res}    1   .23992003 {txt}{c |}
  3. {c |} {res}    2   .20487599 {txt}{c |}
  4. {c |} {res}    3   .32771309 {txt}{c |}
  5. {c |} {res}    4   .31226559 {txt}{c |}
     {c LT}{hline 7}{c -}{hline 11}{c RT}
  6. {c |} {res}    5   .31566993 {txt}{c |}
  7. {c |} {res}    6   .25110787 {txt}{c |}
     {c BLC}{hline 7}{c -}{hline 11}{c BRC}

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/zhou/Desktop/ml.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}26 May 2021, 03:32:09
{txt}{.-}
{smcl}
{txt}{sf}{ul off}